//=====================================
//
// ノンアクター[NoneActor.cpp]
// 機能：何もアクターがない状態を表示
// Author:GP12B332 19 染谷武志
//
//=====================================
#include "NoneActor.h"
#include "../../../Framework/Resource/ResourceManager.h"

//=====================================
// コンストラクタ
//=====================================
NoneActor::NoneActor()
	: PlaceActor()
{
	// モデルデータ参照
	ResourceManager::Instance()->GetMesh("NoneActor", mesh);
	type = Field::Model::None;
}

//=====================================
// デストラクタ（メッシュの開放は基底クラスで）
//=====================================
NoneActor::~NoneActor()
{
}

//=====================================
// 更新処理
//=====================================
void NoneActor::Update()
{
	//とにかく数が多いのでカリングを切ってインスタンシングに任せる
}