//=============================================================================
//
// 町全体リンクレベル上昇イベントクラス [AllLinkLevelUpEvent.cpp]
// Author : HAL東京 GP12B332 41 頼凱興
//
//=============================================================================
#include "../../../main.h"
#include "AllLinkLevelUpEvent.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
const int LinkLevelUpNum = 1;

//*****************************************************************************
// スタティック変数宣言
//*****************************************************************************


//=============================================================================
// コンストラクタ
//=============================================================================
AllLinkLevelUpEvent::AllLinkLevelUpEvent() :
	EventBase(false)
{

}

//=============================================================================
// デストラクタ
//=============================================================================
AllLinkLevelUpEvent::~AllLinkLevelUpEvent()
{

}

//=============================================================================
// 更新
//=============================================================================
void AllLinkLevelUpEvent::Update()
{
	fieldEventHandler->AdjustAllLinkLevel(LinkLevelUpNum);
	UseFlag = false;
}

//=============================================================================
// 描画
//=============================================================================
void AllLinkLevelUpEvent::Draw()
{

}

//=============================================================================
// イベントメッセージを取得
//=============================================================================
string AllLinkLevelUpEvent::GetEventMessage(int FieldLevel)
{
	vector<string> MessageContainer;

	if (FieldLevel == Field::City)
	{
		MessageContainer.push_back("発展は止まるじゃねぇぞ！");
	}
	else if (FieldLevel == Field::World)
	{

	}
	else if (FieldLevel == Field::Space)
	{

	}

	if (!MessageContainer.empty())
	{
		int MessageNo = rand() % MessageContainer.size();
		return MessageContainer.at(MessageNo);
	}
	else
	{
		string ErrMsg = "イベントメッセージがありません";
		return ErrMsg;
	}
}
