//=============================================================================
//
// リンクレベル上昇イベントクラス [LinkLevelUpEvent.cpp]
// Author : HAL東京 GP12B332 41 頼凱興
//
//=============================================================================
#include "../../../main.h"
#include "LinkLevelUpEvent.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
const int LinkLevelUpNum = 1;

//*****************************************************************************
// スタティック変数宣言
//*****************************************************************************


//=============================================================================
// コンストラクタ
//=============================================================================
LinkLevelUpEvent::LinkLevelUpEvent()
{

}

//=============================================================================
// デストラクタ
//=============================================================================
LinkLevelUpEvent::~LinkLevelUpEvent()
{

}

//=============================================================================
// 更新
//=============================================================================
void LinkLevelUpEvent::Update()
{
	fieldController->AdjustAllLinkLevel(LinkLevelUpNum);
	UseFlag = false;
}

//=============================================================================
// 描画
//=============================================================================
void LinkLevelUpEvent::Draw()
{

}

//=============================================================================
// イベントメッセージを取得
//=============================================================================
string LinkLevelUpEvent::GetEventMessage(int FieldLevel)
{
	vector<string> MessageContainer;

	if (FieldLevel == Field::Model::City)
	{
		MessageContainer.push_back("リンクレベル上昇！");
	}
	else if (FieldLevel == Field::Model::World)
	{

	}
	else if (FieldLevel == Field::Model::Space)
	{

	}

	if (!MessageContainer.empty())
	{
		int MessageNo = rand() % MessageContainer.size();
		return MessageContainer.at(MessageNo);
	}
	else
	{
		string ErrMsg = "イベントメッセージがありません";
		return ErrMsg;
	}
}
