//=====================================
//
// アイテムモデル[ItemModel.cpp]
// 機能：フィールド上のアイテムモデル
// Author:GP12B332 19 染谷武志
//
//=====================================
#include "ItemModel.h"
#include "ItemActor.h"
#include "../../../main.h"

//=====================================
// コンストラクタ
//=====================================
ItemModel::ItemModel() :
	actor(NULL)
{
	actor = new ItemActor(D3DXVECTOR3(0.0f, 3.0f, 0.0f));
}

//=====================================
// デストラクタ
//=====================================
ItemModel::~ItemModel()
{
	SAFE_DELETE(actor);
}

//=====================================
// 更新
//=====================================
void ItemModel::Update()
{
	if (actor != NULL)
	{
		actor->Update();
	}
}

//=====================================
// 描画
//=====================================
void ItemModel::Draw()
{
	if (actor != NULL)
	{
		actor->Draw();
	}
}