//=====================================
//
// アイテムアクター[ItemActor.h]
// 機能：アイテムのアクター
// Author:GP12B332 19 染谷武志
//
//=====================================
#ifndef _ITEMACTOR_H_
#define _ITEMACTOR_H_

//**************************************
// マクロ定義
//**************************************

//**************************************
// クラス定義
//**************************************
class ItemActor
{
public:
	ItemActor();
	virtual ~ItemActor();

	virtual void Update();
	virtual void Draw();
};

#endif
