//=============================================================================
//
// 赤いスパークエフェクトクラス [RedSpark.cpp]
// Author : HAL東京 GP12B332 41 頼凱興
//
//=============================================================================
#include "RedSpark.h"

namespace Effect::Game
{
	/**************************************
	ExplosionControllerコンストラクタ
	***************************************/
	RedSparkController::RedSparkController()
	{

	}

	/**************************************
	RedSpark staticメンバ
	***************************************/

	/**************************************
	RedSparkコンストラクタ
	***************************************/
	RedSpark::RedSpark()
	{
		LoadTexture("data/TEXTURE/Particle/MeteorFlare.png");
	}

	/**************************************
	RedSpark更新処理
	***************************************/
	void RedSpark::Update()
	{

	}
}