//=============================================================================
//
// 町レベル減少イベントクラス [CityLevelDecreaseEvent.cpp]
// Author : HAL東京 GP12B332 41 頼凱興
//
//=============================================================================
#include "../../../main.h"
#include "CityLevelDecreaseEvent.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
const int CityLevelDecreaseNum = -1;

//*****************************************************************************
// スタティック変数宣言
//*****************************************************************************


//=============================================================================
// コンストラクタ
//=============================================================================
CityLevelDecreaseEvent::CityLevelDecreaseEvent()
{

}

//=============================================================================
// デストラクタ
//=============================================================================
CityLevelDecreaseEvent::~CityLevelDecreaseEvent()
{

}

//=============================================================================
// 更新
//=============================================================================
void CityLevelDecreaseEvent::Update()
{
	fieldController->AdjustLevelDevelopment(CityLevelDecreaseNum);
	UseFlag = false;
}

//=============================================================================
// 描画
//=============================================================================
void CityLevelDecreaseEvent::Draw()
{

}

//=============================================================================
// イベントメッセージを取得
//=============================================================================
string CityLevelDecreaseEvent::GetEventMessage(int FieldLevel)
{
	vector<string> MessageContainer;

	if (FieldLevel == Field::Model::City)
	{
		MessageContainer.push_back("町レベル減らすイベント");
	}
	else if (FieldLevel == Field::Model::World)
	{

	}
	else if (FieldLevel == Field::Model::Space)
	{

	}

	if (!MessageContainer.empty())
	{
		int MessageNo = rand() % MessageContainer.size();
		return MessageContainer.at(MessageNo);
	}
	else
	{
		string ErrMsg = "イベントメッセージがありません";
		return ErrMsg;
	}
}
