//=============================================================================
//
// 操作反転イベントクラス [MoveInverseEvent.cpp]
// Author : HAL東京 GP12B332 41 頼凱興
//
//=============================================================================
#include "../../../main.h"
#include "MoveInverseEvent.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************


//*****************************************************************************
// スタティック変数宣言
//*****************************************************************************


//=============================================================================
// コンストラクタ
//=============================================================================
MoveInverseEvent::MoveInverseEvent(int RemainTime) : RemainTime(RemainTime)
{
	fieldController->ReverseOperation(true);
}

//=============================================================================
// デストラクタ
//=============================================================================
MoveInverseEvent::~MoveInverseEvent()
{

}

//=============================================================================
// 更新
//=============================================================================
void MoveInverseEvent::Update()
{
	RemainTime--;
	if (RemainTime <= 0)
	{
		fieldController->ReverseOperation(false);
		UseFlag = false;
	}
}

//=============================================================================
// 描画
//=============================================================================
void MoveInverseEvent::Draw()
{

}

//=============================================================================
// イベントメッセージを取得
//=============================================================================
string MoveInverseEvent::GetEventMessage(int FieldLevel)
{
	vector<string> MessageContainer;

	if (FieldLevel == Field::Model::City)
	{
		MessageContainer.push_back("操作反転イベント");
	}
	else if (FieldLevel == Field::Model::World)
	{

	}
	else if (FieldLevel == Field::Model::Space)
	{

	}

	if (!MessageContainer.empty())
	{
		int MessageNo = rand() % MessageContainer.size();
		return MessageContainer.at(MessageNo);
	}
	else
	{
		string ErrMsg = "イベントメッセージがありません";
		return ErrMsg;
	}
}
