//=============================================================================
//
// 送信パケットパラメータクラス [PacketConfig.h]
// Author : HAL東京 GP12B332 41 頼凱興
//
//=============================================================================
#ifndef _PacketConfig_H_
#define _PacketConfig_H_

#include <string>

using namespace std;

// 使用するポート番号
const int ServerPort = 8080;

//*****************************************************************************
// クラス定義
//*****************************************************************************
class PacketConfig
{
public:
	string Header = "これはLink専用の通信パケットです";	// パケットの先頭文字列
	string PlayerName = "Potato";						// プレイヤーの名前
	int AILevel = 0;									// AIレベル
};

#endif