//=============================================================================
//
// 名前入力インプット処理 [NameEntryInput.cpp]
// Author : Yu Oohama (bnban987@gmail.com)
//
//=============================================================================
#include "../../../../main.h"
#include "../../../../Framework/Input/input.h"
#include "NameEntryInput.h"

//*****************************************************************************
// コンストラクタ
//*****************************************************************************
NameEntryInput::NameEntryInput()
{
}

//*****************************************************************************
// デストラクタ
//*****************************************************************************
NameEntryInput::~NameEntryInput()
{
}

//=============================================================================
// リールアップ入力取得処理
//=============================================================================
bool NameEntryInput::GetReelUp()
{
	//上ボタンが押された
	if (Keyboard::GetTrigger(DIK_UP) || GamePad::GetTriggerPOV(0, POV_UP)) return true;
	return false;
}

//=============================================================================
// リールダウン入力取得処理
//=============================================================================
bool NameEntryInput::GetReelDown()
{
	//下ボタンが押された
	if (Keyboard::GetTrigger(DIK_DOWN) || GamePad::GetTriggerPOV(0, POV_DOWN)) return true;
	return false;
}

//=============================================================================
// カーソル左移動入力取得処理
//=============================================================================
bool NameEntryInput::GetCursorLeft()
{
	//左ボタンが押された
	if (Keyboard::GetTrigger(DIK_LEFT) || GamePad::GetTriggerPOV(0, POV_LEFT)) return true;
	return false;
}

//=============================================================================
// カーソル右移動入力取得処理
//=============================================================================
bool NameEntryInput::GetCursorRight()
{
	//右ボタンが押された
	if (Keyboard::GetTrigger(DIK_RIGHT) || GamePad::GetTriggerPOV(0, POV_RIGHT)) return true;
	return false;
}

//=============================================================================
// エントリー終了入力取得処理
//=============================================================================
bool NameEntryInput::GetFinishedEntry()
{
	//エンターキーが押された
	if (Keyboard::GetTrigger(DIK_RETURN) || GamePad::GetTrigger(0, BUTTON_C)) return true;
	return false;
}
