//=============================================================================
//
// ゲームビュアーパラメータ [GameViewerParam.h]
// Author : Yu Oohama (bnban987@gmail.com)
//
//=============================================================================
#ifndef _GAME_VIEWER_PARAM_H_
#define _GAME_VIEWER_PARAM_H_

//*****************************************************************************
// クラス定義
//*****************************************************************************
class GameViewerParam
{
public:
	//AIレベル
	int levelAI;

	//レベル割合
	float ratioLevel;

	//残り時間
	float remainTime;

	/*****************************************
	10/25（立花）
	仕様変更により、地球防衛軍と保険のストックは削除
	ドリルと橋のストックは統合することになったので変更
	********************************************/
	//ストック数
	int stockNum;

	bool InBanStock = false;
};

#endif