//=====================================
//
// ネーム[Name.h]
// 機能：ネームのデータを保存するクラス
// Author:GP12B332 19 染谷武志
//
//=====================================
#include "Name.h"

//=====================================
// コンストラクタ
//=====================================
Name::Name()
{
	for (int i = 0; i < 3; i++)
	{
		num[i] = 0;
	}
}

//=====================================
// コンストラクタ
//=====================================
Name::Name(int first, int second, int third)
{
	num[0] = first;
	num[1] = second;
	num[2] = third;
}

//=====================================
// コンストラクタ
//=====================================
Name::Name(const std::string & name)
{
	for (int i = 0; i < 3; i++)
	{
		num[i] = std::stoi(name.substr(i, 1));
	}
}

//=====================================
// デストラクタ
//=====================================
Name::~Name()
{
}

//=====================================
// コピーコンストラクタ
//=====================================
Name::Name(const Name & in)
{
	for (int i = 0; i < 3; i++)
	{
		num[i] = in.num[i];
	}
}

//=====================================
// セット
//=====================================
void Name::Set(int first, int second, int third)
{
	num[0] = first;
	num[1] = second;
	num[2] = third;
}

//=====================================
// ゲット
//=====================================
int Name::Get(int No)
{
	return num[No];
}
