//=====================================
//
//TitleScene.cpp
//機能:タイトルシーン
//Author:GP12B332 21 立花雄太
//
//=====================================
#include "TitleScene.h"
#include "../../Framework/Tool/DebugWindow.h"

/**************************************
初期化処理
***************************************/
void TitleScene::Init()
{

}

/**************************************
終了処理
***************************************/
void TitleScene::Uninit()
{
}

/**************************************
更新処理
***************************************/
void TitleScene::Update()
{
}

/**************************************
描画処理
***************************************/
void TitleScene::Draw()
{
	Debug::Log("CurrentScene:Title");
}
