//=====================================
//
// スコア[Score.cpp]
// 機能：スコア管理クラス
// Author:GP12B332 19 染谷武志
//
//=====================================
#include "Score.h"

namespace Field
{
	//=====================================
	// コンストラクタ
	//=====================================
	Score::Score() :
		current(FieldLevel::City),
		score()
	{
	}


	//=====================================
	// デストラクタ
	//=====================================
	Score::~Score()
	{
	}

	//=====================================
	// スコアの取得
	//=====================================
	int Score::GetScore(FieldLevel level)
	{
		return score[level];
	}

	//=====================================
	// スコアのセット
	//=====================================
	void Score::SetScore(int score, FieldLevel current)
	{
		this->score[current] = score;
	}
}