//=============================================================================
//
// イベントビュアーパラメータ [EventViewerParam.h]
// Author : Yu Oohama (bnban987@gmail.com)
//
//=============================================================================
#ifndef _EVENT_VIEWER_PARAM_H_
#define _EVENT_VIEWER_PARAM_H_

//*****************************************************************************
// クラス定義
//*****************************************************************************
class EventViewerParam
{
public:
	//ストックが禁止されたか
	bool isStockSealed;
};

#endif